Generate year 2026 and year 2038 numbers from the previous calculations

In [1]:
import pandas as pd
import numpy as np

In [2]:
# Test Calc
# 147*np.exp(r*2)

In [3]:
def exp_growth_calc(zero_pop, final_pop, final_pop_years, calc_years, fields):
    # http://www.coolmath.com/algebra/17-exponentials-logarithms/06-population-exponential-growth-01
    # r = np.log(244/147)/10
    # r = np.log(P/P0)/time
    return zero_pop[fields]*np.exp(np.log(final_pop[fields]/zero_pop[fields])/final_pop_years*calc_years)

In [4]:
fields = ['TOTHH', 'HHPOP', 'TOTPOP', 'EMPRES',
       'SFHH', 'MFHH', 'HH1', 'HH2', 'HH3', 'HH4', 'INC1', 'INC2', 'INC3',
       'INC4', 'MHHINC', 'TACRES', 'RESACRE', 'CIACRE', 'Z2SHARE',
       'TEMP', 'RETEMP', 'SEREMP', 'OTHEMP', 'AGEMP', 'MANEMP', 'WHOEMP',
       'AGE0004', 'AGE0519', 'AGE2044', 'AGE4564', 'AGE65', 'AGE0513',
       'AGE1417', 'AGE1824', 'ESENR', 'HSENR', 'COLLENR', 'COLLENRF',
       'COLLENRP']
# df_25[fields].head()

In [5]:
df_25 = pd.read_csv('output/bart_calcs_clean2025.csv')
df_35 = pd.read_csv('output/bart_calcs_clean2035.csv')

df_26 = df_25.copy()
df_26[fields] = exp_growth_calc(df_25, df_35, 10, 1, fields)
df_26.to_csv('output/bart_calcs_clean2026.csv', index=False)

/Users/vivek/anaconda3/envs/GIS/lib/python3.6/site-packages/ipykernel_launcher.py:5: RuntimeWarning: divide by zero encountered in log
  """

In [6]:
df_35 = pd.read_csv('output/bart_calcs_clean2025.csv')
df_40 = pd.read_csv('output/bart_calcs_clean2035.csv')

df_38 = df_35.copy()
df_38[fields] = exp_growth_calc(df_35, df_40, 5, 3, fields)
df_38.to_csv('output/bart_calcs_clean2038.csv', index=False)

/Users/vivek/anaconda3/envs/GIS/lib/python3.6/site-packages/ipykernel_launcher.py:5: RuntimeWarning: divide by zero encountered in log
  """

In [7]:
df_35.head()

,ZONE,DIST,SDIST,COUNTY,TOTHH,HHPOP,TOTPOP,EMPRES,SFHH,MFHH,...,AGE65,AGE0513,AGE1417,AGE1824,ESENR,HSENR,COLLENR,COLLENRF,COLLENRP,TAZ1454
0,1701,1,1,1,50.0,80.0,89.0,39.0,1.0,49.0,...,22.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,1
1,1702,1,1,1,147.0,235.0,259.0,113.0,2.0,145.0,...,64.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,2
2,1703,1,1,1,283.0,455.0,501.0,218.0,5.0,278.0,...,124.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,3
3,1704,1,1,1,164.0,267.0,295.0,129.0,3.0,161.0,...,73.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,4
4,1705,1,1,1,675.0,1086.0,1198.0,522.0,13.0,662.0,...,295.0,0.0,0.0,0.0,0.0,0.0,68.5,68.5,0.0,5

In [8]:
df_38.head()

,ZONE,DIST,SDIST,COUNTY,TOTHH,HHPOP,TOTPOP,EMPRES,SFHH,MFHH,...,AGE65,AGE0513,AGE1417,AGE1824,ESENR,HSENR,COLLENR,COLLENRF,COLLENRP,TAZ1454
0,1701,1,1,1,50.597622,81.786731,90.788052,39.596959,1.000000,49.597574,...,23.753799,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1
1,1702,1,1,1,199.232796,321.398804,353.031732,154.341792,2.550849,196.678744,...,92.384943,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2
2,1703,1,1,1,282.399575,457.395797,502.199044,219.197808,4.373448,278.000000,...,131.066596,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,3
3,1704,1,1,1,202.986452,331.530714,366.212384,160.154417,3.565205,199.419238,...,95.884376,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,4
4,1705,1,1,1,685.743106,1111.008521,1221.842181,533.909653,11.760152,673.928497,...,318.957173,NaN,NaN,NaN,NaN,NaN,72.329088,72.329088,NaN,5

In [9]:
df_40.head()

,ZONE,DIST,SDIST,COUNTY,TOTHH,HHPOP,TOTPOP,EMPRES,SFHH,MFHH,...,AGE65,AGE0513,AGE1417,AGE1824,ESENR,HSENR,COLLENR,COLLENRF,COLLENRP,TAZ1454
0,1701,1,1,1,51.0,83.0,92.0,40.0,1.0,50.0,...,25.0,0.0,0.0,0.0,0,0,0,0,0,1
1,1702,1,1,1,244.0,396.0,434.0,190.0,3.0,241.0,...,118.0,0.0,0.0,0.0,0,0,0,0,0,2
2,1703,1,1,1,282.0,459.0,503.0,220.0,4.0,278.0,...,136.0,0.0,0.0,0.0,0,0,0,0,0,3
3,1704,1,1,1,234.0,383.0,423.0,185.0,4.0,230.0,...,115.0,0.0,0.0,0.0,0,0,0,0,0,4
4,1705,1,1,1,693.0,1128.0,1238.0,542.0,11.0,682.0,...,336.0,0.0,0.0,0.0,0,0,75,75,0,5